package com.limecoders.informativeapp.fragments.mainfragment;

import androidx.lifecycle.Observer;
import androidx.lifecycle.ViewModelProvider;

import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.RecyclerView;
import androidx.recyclerview.widget.StaggeredGridLayoutManager;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.google.firebase.database.DatabaseReference;
import com.google.firebase.database.FirebaseDatabase;
import com.limecoders.informativeapp.R;
import com.limecoders.informativeapp.RecipeAdapter;
import com.limecoders.informativeapp.Utils;
import com.limecoders.informativeapp.pojo.RecipeDetailsModel;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.UUID;

public class MainFragment extends Fragment {

    private MainViewModel mViewModel;
    private RecyclerView recipeRecyclerView;


    private List<RecipeDetailsModel> models = new ArrayList<>();
    private RecipeAdapter adapter;

    public static MainFragment newInstance() {
        return new MainFragment();
    }

    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container,
                             @Nullable Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.main_fragment, container, false);

        recipeRecyclerView = view.findViewById(R.id.recipeRecyclerView);

        Utils.initpDialog(getActivity(),"Loading...");
        Utils.showpDialog();

        recipeRecyclerView.setLayoutManager(new StaggeredGridLayoutManager(2,StaggeredGridLayoutManager.VERTICAL));
        recipeRecyclerView.setHasFixedSize(true);
        adapter = new RecipeAdapter(getActivity(),false);
        recipeRecyclerView.setAdapter(adapter);

        return view;
    }

    @Override
    public void onActivityCreated(@Nullable Bundle savedInstanceState) {
        super.onActivityCreated(savedInstanceState);
        mViewModel = new ViewModelProvider(this).get(MainViewModel.class);

//        setRecipeData();

        mViewModel.getRecipesModel().observe(getViewLifecycleOwner(), new Observer<List<RecipeDetailsModel>>() {
            @Override
            public void onChanged(List<RecipeDetailsModel> recipeModels) {
                adapter.setRecipeModel(recipeModels);
                Utils.hidepDialog();
            }
        });

    }

//    private void setRecipeData() {
//
//        List<RecipeDetailsModel> models = new ArrayList<>();
//        models.add(new RecipeDetailsModel("1","recipe","番茄炒蛋","材料：","番茄2粒或3粒，鸡蛋3粒，小葱1根 （选项），白糖少许，白胡椒粉少许，盐少许，味精少许","做法：","1. 番茄洗净后切块。\n" +
//                "\n" +
//                "2. 鸡蛋打入碗中，加入少许白胡椒粉、盐和味精，打散备用。\n" +
//                "\n" +
//                "3. 小葱洗净后切成葱花。\n" +
//                "\n" +
//                "4. 炒锅内倒少许油烧至微热，倒入鸡蛋快速划散，凝固后盛出。\n" +
//                "\n" +
//                "\n" +
//                "5. 炒锅内重新倒入少许油烧至7成热，倒入西番茄大火煸炒，然后加入少许白糖炒匀，再倒入鸡蛋一起翻炒，最后调入少许盐和味精，起锅前撒上葱花即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("2","","清炒高丽菜","材料：","高丽菜半颗，红萝卜（切花切片）随意，蒜头两三粒，盐一匙，虾米少许。\n","做法：","1．\t起热油一匙，倒入蒜末爆炒约20秒钟，再倒入虾米与红萝卜片。\n" +
//                "\n" +
//                "2．\t倒入洗净的高丽菜一同拌炒，快熟时加入盐巴、半碗水盖锅闷煮至沸腾。\n" +
//                "\n" +
//                "3．\t掀盖收干汤汁后即可盛起。","","","","","",""));
//        models.add(new RecipeDetailsModel("3","","九层塔煎蛋","材料：","九层塔适量, 盐巴少许, 鸡蛋5颗,油适量","做法：","1．将九层塔先用料理机弄成末状。\n" +
//                "\n" +
//                "2．将鸡蛋放入碗中。加入九层塔末一起搅拌均在加如少许盐巴。\n" +
//                "\n" +
//                "3．热锅加入油.将扮好的食材倒入锅中.煎成圆状。\n" +
//                "\n" +
//                "4．两面煎至金黄色即可起锅切片摆盘。\n" +
//                "\n" +
//                "\n" +
//                "5. 炒锅内重新倒入少许油烧至7成热，倒入西番茄大火煸炒，然后加入少许白糖炒匀，再倒入鸡蛋一起翻炒，最后调入少许盐和味精，起锅前撒上葱花即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("4","","水煮鱼片","材料：","鱼片、黄豆芽、花椒、干辣椒、姜、胡椒粉、辣椒粉、白糖、醋、淀粉、蒜、姜、葱、料酒、豆瓣酱、蛋清、高汤、香葱。","做法：","1．鱼肉片用少许盐、料酒、生粉和一个蛋清抓匀腌15分钟。\n" +
//                "\n" +
//                "2．锅置旺火上油热后，放入花椒和三大匙红油豆瓣爆香，加姜、蒜、葱、干红辣椒中火煸炒。\n" +
//                "\n" +
//                "3．倒入高汤，加盐、料酒、胡椒粉、辣椒粉、少许醋、白糖、酱油，（尝一下咸淡)。汤滚开保持大火，一片片将鱼片放入，用筷子拨散，3～4分钟放入鸡精（或味精）即可关火。\n" +
//                "\n" +
//                "4．把煮好的鱼及全部汤汁倒入碗中。\n" +
//                "\n" +
//                "5．另取一干净锅，倒入油，待油热后，关火先晾一下。然后加入多多的花椒及干辣椒(看个人的嗜麻辣程度)，用小火慢慢炒出花椒和辣椒的香味，把锅中的油及花椒、辣椒一起倒入盛鱼的碗中，（也可以在大盆里上面放好辣椒，然后将熟花椒的热油倒到盆中）上面撒上香葱即可。\n" +
//                "\n" +
//                "\n" +
//                "5. 炒锅内重新倒入少许油烧至7成热，倒入西番茄大火煸炒，然后加入少许白糖炒匀，再倒入鸡蛋一起翻炒，最后调入少许盐和味精，起锅前撒上葱花即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("5","","香菇瘦肉粥","材料：","白米1碗 （浸泡7-8小时），新鲜香菇5朵，胡萝卜1根，瘦肉末50克，盐5克，香油 15毫升，姜3片","做法：","1. 砂锅中加入水烧开，然后放入白米搅拌均匀，用中火煮至沸腾。同时将瘦肉末加入一小勺料酒腌制10分钟，香菇洗净后切成片，胡萝卜切成丝，姜切成丝备用；\n" +
//                "\n" +
//                "2. 粥煮开后，转成小火，不停搅拌防止糊底，同时放入一把汤勺，可以有效地防止粥溢出；\n" +
//                "\n" +
//                "3. 粥煮到浓稠，米粒明显的开花后，依次放入胡萝卜、瘦肉拌匀，肉末变白成熟后，再放入香菇片、姜丝，继续煮两分钟即可，出锅前加入适量的盐、香油调味即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("6","","海带豆腐排骨汤","材料：","干海带半片，豆腐一斤，排骨两根，盐少许，醋少许，鸡精少许，胡椒粉少许，姜少许\n","做法：","1.干海带用凉水泡一上午，洗净切片；豆腐切小块，支一锅水开后加少许盐将海带和豆腐焯半分钟出锅备用；\n" +
//                "\n" +
//                "2.排骨洗净焯一遍，用水冲洗干净；\n" +
//                "\n" +
//                "3.沙锅内做水，下排骨放几片姜，滴几滴醋，开后改小火煨四十分钟；\n" +
//                "\n" +
//                "4.加入海带和豆腐一起炖十分钟，加入盐，鸡精，胡椒粉拌匀即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("7","","腐乳蒸鸡","材料：","鸡腿 2个，鸡翅 4个，腐乳 3片，蒜米 适量，蚝油 2汤匙，盐 少许","做法：","1. 鸡肉洗干净，加入腐乳蚝油盐搅拌均匀，加一点水。\n" +
//                "\n" +
//                "2. 放进冰箱帮助入味，到了晚上蒸熟15-20分钟即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("8","","马蹄蒸肉饼","材料：","肉末 150克，马蹄 1个，葱 1棵， 姜 5克，淀粉 2克，生抽 5毫升，盐 少许","做法：","1. 马蹄去皮剁碎，姜丝用清水浸泡，肉末再用刀剁细一些。\n" +
//                "\n" +
//                "2. 肉末放入碗中，加入马蹄碎，姜水，淀粉，生抽，盐搅拌均匀。\n" +
//                "\n" +
//                "3. 将拌好的肉末放入一个平盘中铺平，上锅蒸10分钟至肉饼熟透即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("9","","蒸肉饼酿豆腐","材料：","梅头肉饼 150g，硬豆腐 1砖","肉饼调味料：","生抽 1/2茶匙，绍兴酒 1/2茶匙，蚝油 1/2茶匙，生粉 1/2茶匙，水 1/2茶匙，胡椒 少许。\n","做法：","1. 肉饼加入调味料，循同一个方向搅匀，醃15分钟。\n" +
//                "\n" +
//                "2.豆腐切成8-10件，酿入肉饼 。\n" +
//                "\n" +
//                "3. 隔水蒸8分钟。","","","",""));
//        models.add(new RecipeDetailsModel("10","","蒸三色蛋","材料：","皮蛋 2颗，咸蛋 2颗，鸡蛋 4颗","调味料：","盐 少许，白胡椒粉 少许，味霖 1小匙，米酒 1小匙","做法：","1. 皮蛋去壳，放入滚水中汆烫15秒，切小丁；咸蛋去壳切小丁，备用。\n" +
//                "\n" +
//                "2. 将鸡蛋打入容器中，加入所有调味料溷合拌匀。\n" +
//                "\n" +
//                "3.将作法1、2的所有材料溷合，倒入有深度的模型中，放入冒蒸气的蒸锅中，盖锅盖以中火蒸10分钟，取出放凉切块即可。","","","",""));
//        models.add(new RecipeDetailsModel("11","","豆腐蒸金针菇","材料：","金针菇 适量，日本豆腐 1条，小辣椒 1根，蒜 5瓣，葱花 适量，蚝油 适量，麻油 适量，蒸鱼鼓油 适量","做法：","1. 金针菇把尾巴去掉，洗净，放大碗里泡一会儿。\n" +
//                "\n" +
//                "2. 泡着金针菇的同时准备其他材料，蒜切丁，新鲜小辣椒切小段，葱切成葱花，日本豆腐切片，准备完毕。\n" +
//                "\n" +
//                "3. 将金针菇冲干净沥水，铺在碗底（盘底），日本豆腐摆在金针菇周围或上面，然后把葱花，蒜末，新鲜小辣椒放在中间，撒上适量蒸鱼豉油、蚝油、麻油，上锅，隔水蒸10分钟左右。","","","","","",""));
//        models.add(new RecipeDetailsModel("12","","清炒芦笋","材料：","芦笋, 海鲜菇, 蟹味菇, 萝卜， 小玉米","做法：","1. 芦笋洗净去掉根部老皮。海鲜菇和蟹味菇去根洗净。 萝卜去皮。\n" +
//                "\n" +
//                "2．芦笋和海鲜菇切斜段。萝卜切片，小玉米切小块。\n" +
//                "\n" +
//                "3．芦笋和海鲜菇切斜段。\n" +
//                "\n" +
//                "4．海鲜菇和蟹味菇也焯水，捞出沥干水分。\n" +
//                "\n" +
//                "5．炒锅中加适量油烧热，下芦笋，萝卜，小玉米翻炒均匀。\n" +
//                "\n" +
//                "6．加入海鲜菇和蟹味菇翻炒，再放适量盐调味。","","","","","",""));
//        models.add(new RecipeDetailsModel("13","","玉米排骨汤","材料：","小排骨300克 玉米一根 胡萝卜一根，葱， 姜， 料酒， 盐，红枣","做法：","1.小排加料酒焯水，玉米、胡萝卜改刀，葱结姜片备用。\n" +
//                "\n" +
//                "2.将所有原料下锅煮，烧开后撇沫，再炖60分钟。\n" +
//                "\n" +
//                "3.最后起锅调味，点少许醋，可以更好的帮助钙质的吸收。出锅即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("14","","醋溜土豆丝","材料：","土豆300克，干辣椒、精盐、白醋、花椒各适量\n","做法：","1.土豆去皮，切成细丝。将切好的土豆丝过几遍冷水，冲去淀粉，再捞出，沥干水分。\n" +
//                "\n" +
//                "2.锅中放油，开火烧热，放入花椒，炸出香味；捞出花椒，再放干辣椒炸一下，爆出香味，立刻加入土豆丝，翻炒几下。\n" +
//                "\n" +
//                "3.等土豆丝变成半透明时，加入适量白醋、精盐，再快速翻炒几下，炒匀。\n" +
//                "\n" +
//                "4.等土豆丝炒熟后，即可装盘上桌。","","","","","",""));
//        models.add(new RecipeDetailsModel("15","","南乳炸肉","材料：","三层肉 300克（去皮切条状）\n","醃料：","南乳 1 ½块，南乳汁 1汤匙，糖半汤匙，盐¼茶匙，蒜米 5粒 （切碎）","炸粉：","炸鸡粉 2大匙，地瓜粉 3大匙（拌匀）","做法：","1. 三层肉用醃料搅拌均匀醃制3小时。\n" +
//                "\n" +
//                "2. 热油把肉均匀的沾满炸粉放入炸至金黄色，捞起切片即可。","",""));
//        models.add(new RecipeDetailsModel("16","","蚝油生菜","材料：","生菜1个。食用油适量，蚝油适量，蒜1瓣，干辣椒1个，白砂糖少许，鸡精少许","做法：","1．\t准备所需材料。把生菜掰开，然后洗淨。\n" +
//                "\n" +
//                "2．\t蒜和干辣椒洗淨剁碎。\n" +
//                "\n" +
//                "3．\t蚝油加入白砂糖、鸡精、清水调匀。\n" +
//                "\n" +
//                "4．\t锅内加入清水烧开。把生菜放入锅内焯烫。\n" +
//                "\n" +
//                "5．\t焯烫至熟后，捞起装盘。\n" +
//                "\n" +
//                "6．\t重新起油锅，把油烧热。\n" +
//                "\n" +
//                "7．\t放入蒜和辣椒碎炒出香味。再倒入调好蚝油。把它煮沸。\n" +
//                "\n" +
//                "8．\t最后把蚝油汁浇在生菜上即可食用。","","","","","",""));
//        models.add(new RecipeDetailsModel("17","","香脆虾球","材料：","中虾 ，青葱粒 ，粟米粉","腌料：","苏打粉 半茶匙，盐1茶匙，胡椒粉 1茶匙，糖 1茶匙","脆浆：","自发面粉 200克，粘米粉 10克，清水 200 – 250毫升，油 1汤匙半，原味Eno 半包，盐 1茶匙 （不要太浓或太稀，虾沾上后可慢慢滑下即可）","做法：","1. 将虾去壳留尾，加入腌料半小时，待用。\n" +
//                "\n" +
//                "2. 将脆浆的材料全部溷合均匀，加入青葱个溷合均匀。\n" +
//                "\n" +
//                "3. 将腌好的虾沾上粟米粉，再沾上脆浆，放入热油中，以中火炸至金黄色，沥干油即可。","",""));
//        models.add(new RecipeDetailsModel("18","","苦瓜鸡肉","材料：","鸡肉，苦瓜，豆瓣酱，豆豉，蒜蓉，蚝油","做法：","1. 先用蒜米炒香鸡肉，半熟时加入一大匙豆瓣酱，豆豉，1汤匙蚝油。\n" +
//                "\n" +
//                "2. 炒均匀后，加入苦瓜再炒一会。\n" +
//                "\n" +
//                "3. 加入适量水分。\n" +
//                "\n" +
//                "4. 汁收到差不多，加点盐，糖即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("19","","酱油鸡","材料：","鸡腿 3个，酱油 4汤匙，黑酱油 4汤匙，冰糖 3-4粒，青葱，芫荽，蒜米（拍烂），姜片6片， 干辣椒2个 ","做法：","1. 准备一锅水，水量刚好盖住鸡肉，开火让水滚。\n" +
//                "\n" +
//                "2. 青葱，芫荽，蒜米拍烂，姜片，干辣椒放进水里。\n" +
//                "\n" +
//                "3. 倒入酱油，黑酱油，放入鸡肉，用小火慢慢焖熟，不用大火。\n" +
//                "\n" +
//                "4. 大概半小时至45分钟，熟透即上桌。\n" +
//                "\n" +
//                "5. 剩下的酱油汁，可开大火收一收，调味，浇在鸡肉上即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("20","","自制海鲜豆腐","材料：","鱼肉 100克，虾肉 100克，红萝卜 1小段，蒜头 4粒，葱仔 4粒，青葱 1棵（全部材料切细），蛋豆腐（压碎）2条 ","调味料：","鸡精粉 2茶匙，盐半茶匙，胡椒粉 半茶匙，糖1茶匙，薯粉 2汤匙 ","做法：","1. 把全部材料和调味料放入盘里搅拌均匀至起胶。\n" +
//                "\n" +
//                "2. 用7寸盘抹油，放入搅拌好的豆腐铺平压紧。\n" +
//                "\n" +
//                "3. 盘口包上保鲜纸，大火蒸30分钟至熟。\n" +
//                "\n" +
//                "4. 起出待凉切块，沾上薯粉炸至金黄色即可。","","","",""));
//        models.add(new RecipeDetailsModel("21","","亚参鱼头","材料：","红枣鱼头 1个，金枫叶 适量，羊角豆 （切块） ，茄子（切块） 适量，姜花，黄梨（切片），番茄，罗望子汁 1杯，盐 少许，糖 少许 \n","香料：","大洋葱 2粒，蒜 1大颗，姜 50克，葱头 100克，香茅 2棵 （搅烂）","做法：","1. 起锅热油，加入搅烂香料炒香至熟。\n" +
//                "\n" +
//                "2. 炒至香料形成油脂，加入2000毫升的水。\n" +
//                "\n" +
//                "3. 煮开后，改小火，加入亚参汁，羊角豆，茄子，番茄，黄梨煮至熟。\n" +
//                "\n" +
//                "4. 最后加入鱼头，盐和糖调味即可。","","","",""));
//        models.add(new RecipeDetailsModel("22","","花雕鸡","材料：","菜园鸡，花凋酒 1杯，老姜 1大块，青葱 ","做法：","1. 用麻油爆香姜片和白色葱段。\n" +
//                "\n" +
//                "2. 放入切小块的鸡，大火炒。\n" +
//                "\n" +
//                "3. 加入花雕酒（别加水）盖锅盖。\n" +
//                "\n" +
//                "4. 加入蚝油，盐酱油调味即可。\n" +
//                "\n" +
//                "5. 焖大约半小时即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("23","","番茄炒菠菜","材料：","红番茄1个、菠菜100公克、姜末1/2茶匙、蒜茸1/4 茶匙、盐1/4 茶匙、、酒1/2 茶匙\n","做法：","1.\t菠菜洗净切段;红番茄洗净切块,备用。\n" +
//                "\n" +
//                "2.\t热锅,加入1大匙沙拉油,蒜茸\n" +
//                "\n" +
//                "3.\t同作法3原锅,放入姜末、蒜茸、菠菜段、番茄块炒1分钟,所有调味料,以大火快炒均匀即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("24","","西洋菜排骨汤","材料：","西洋菜、排骨、红枣","做法：","1. 将西洋菜泡水、洗净\n" +
//                "\n" +
//                "2. 排骨飞水后，加水滚开后转小火煲40分钟左右，下红枣\n" +
//                "\n" +
//                "3. 西洋菜洗净后大的用手掰扯短，整条也行，放入汤中，再滚又转小火十几二十分钟放一茶勺盐就好了。","","","","","",""));
//        models.add(new RecipeDetailsModel("25","","剁椒辣炒鸡胗","材料：","鸡胗，长青椒，剁椒，姜，葱，蒜，花椒，盐，料酒，老抽，香油","做法：","1. 鸡胗清洗干净后切薄片。\n" +
//                "\n" +
//                "2. 姜末、红剁椒、料酒。\n" +
//                "\n" +
//                "3. 腌制20分钟左右。\n" +
//                "\n" +
//                "4. 长青椒洗净去籽切段，葱姜蒜切片。\n" +
//                "\n" +
//                "5. 热锅下油，油热后，依次下入花椒，姜、葱、蒜炒香。\n" +
//                "\n" +
//                "6. 放腌好的鸡胗片大火翻炒至断生。\n" +
//                "\n" +
//                "7. 加入青椒块翻炒，加少许老抽，炒至青椒断生，放少许盐（因为剁椒本身比较咸，放盐时尝尝再加哦），淋少许香油即可起锅装盘。","","","","","",""));
//        models.add(new RecipeDetailsModel("26","","麻婆茄子","材料：","茄子300g，葱姜蒜50g，油适量，豆瓣酱一勺，料酒一勺，白糖一小勺，生抽一勺，辣椒油、花椒油适量\n","做法：","1.茄子去蒂洗净，切成块状，用淡盐水浸泡10分钟，葱花、大蒜切碎，姜切末；\n" +
//                "\n" +
//                "2.热锅油热后放入茄子，小火慢煎至茄子微软后盛出；\n" +
//                "\n" +
//                "3.锅中倒油，放入蒜末和姜末爆香，下豆瓣酱煸炒出红油；\n" +
//                "\n" +
//                "4.将茄子放入炒匀，叫料酒，白糖，生抽，倒入清水焖煮一会，调入辣椒油、花椒油，待汤汁收干，撒上葱花即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("27","","可乐鸡翅","材料：","鸡翅 10只 ，可乐 150ml， 盐 适量， 姜 2片， 酱油 少许， 老抽 少许 料酒 少许 小葱 适量","做法：","1. 鸡中翅洗净，用牙签在鸡翅扎些小洞\n" +
//                "\n" +
//                "2. 姜、蒜、小葱切碎\n" +
//                "\n" +
//                "3. 将鸡翅放盘内，再加入姜、蒜、小葱\n" +
//                "\n" +
//                "4. 然后加入盐、酱油、老抽、料酒\n" +
//                "\n" +
//                "5. 用手抓均腌制15分钟\n" +
//                "\n" +
//                "6. 再将腌制好的鸡翅放入锅内煎至\n" +
//                "\n" +
//                "7. 加入 的可乐烧开，可乐和鸡翅持平即可\n" +
//                "\n" +
//                "8. 用小火焖至汤汁变浓时即可收火","","","","","",""));
//        models.add(new RecipeDetailsModel("28","","洋葱煎蛋","材料：","洋葱、鸡蛋、盐\n","做法：","1. 准备洋葱、鸡蛋、盐\n" +
//                "\n" +
//                "2. 洋葱切细丝，鸡蛋打散备用。\n" +
//                "\n" +
//                "3. 洋葱丝加盐，油锅中放少许油，煸炒一下至熟。\n" +
//                "\n" +
//                "4. 把煸好的洋葱放入鸡蛋中搅匀，可根据口味加盐。\n" +
//                "\n" +
//                "5. 油锅中摊成蛋饼，两面煎至金黄。 装盘。","","","","","",""));
//        models.add(new RecipeDetailsModel("29","","盐焗鸡","材料：","鸡腿/鸡只、粗海盐(6包，每包1斤)、生菜(5片)、沙姜(半小块)、白纸(1张)，当归数片、精盐(1汤匙)","做法：","1. 洗净沙姜切成末，1汤匙盐，均匀地抹在鸡身上。顺便帮鸡按摩几下。\n" +
//                "\n" +
//                "2. 铺平一张普通白纸，将当归片铺在鸡腿/鸡只周围再将鸡用纸包裹起来。\n" +
//                "\n" +
//                "3. 将2包粗海盐倒入锅内后倒1碗水，放进用纸包好的鸡，再倒入4包粗海盐。\n" +
//                "\n" +
//                "4. 盖上锅盖后，用大火煮10分钟，转中火再煮20分钟，然后熄火静置30分钟。\n" +
//                "\n" +
//                "5. 把洗净的生菜叶铺在碟边，舀出锅中的海盐，撕开鸡身上的纸，用筷子取出鸡放于碟中。","","","","","",""));
//        models.add(new RecipeDetailsModel("30","","","辣子鸡","材料：","鸡腿2只，干辣椒50g，料酒，盐，酱油， 胡椒粉，花椒，姜，蒜（要多，至少2粒）\n","做法：","1. 干辣椒洗净，每个用剪刀剪成三段。\n" +
//                "\n" +
//                "2. 鸡肉剁成和剪好的辣椒差不多大的小块。\n" +
//                "\n" +
//                "3. 蒜剥好，不要切。\n" +
//                "\n" +
//                "4. 炒锅放油（多一些），放姜蒜爆锅，放入鸡肉块，加料酒炒干水分，约翻炒6分钟左右。\n" +
//                "\n" +
//                "5. 放花椒、干辣椒翻炒5-8分钟。\n" +
//                "\n" +
//                "6. 加酱油、盐、胡椒粉，翻炒均匀即可。","","","","",""));
//        models.add(new RecipeDetailsModel("31","","糖醋排骨","材料：","排骨，油麦菜","配料：","桂皮，八角，香叶，姜片，白糖，生抽，白醋，盐，鸡粉，料酒\n","做法：","1. 锅内放水放桂皮、大料、香料、料酒、适量盐，放入排骨焖煮30分钟。\n" +
//                "\n" +
//                "2. 排骨出锅后晾凉，油麦菜过水汆熟。\n" +
//                "\n" +
//                "3. 另起锅，热锅下油，下糖，开小火炒糖色，接着放入姜片。\n" +
//                "\n" +
//                "4. 锅里有姜糖味后放入小排，快速翻炒，放入生抽、料酒、少许盐。\n" +
//                "\n" +
//                "5. 小火焖五分钟后下白醋，翻炒均匀后出锅，摆盘。","","","",""));
//        models.add(new RecipeDetailsModel("32","","排骨冬瓜汤","材料：","冬瓜，排骨，盐，酱油","做法：","1. 冬瓜去皮洗净切块沥水。\n" +
//                "\n" +
//                "2. 排骨切块洗净沥水。\n" +
//                "\n" +
//                "3. 锅中放水，加点料酒后先煮排骨。\n" +
//                "\n" +
//                "4. 至排骨酥软了，再入冬瓜。\n" +
//                "\n" +
//                "5. 最后加点盐和酱油，烧开后出锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("33","","竹笋炒肉","材料：","竹笋，猪肉，淀粉，料酒，糖，生抽，老抽，蒜\n","做法：","1. 竹笋切片，肉切片，肥肉另外放置待用，瘦肉用糖，盐，油，老抽和淀粉腌制半个小时，蒜拍碎\n" +
//                "\n" +
//                "2. 锅烧热，不用放油，把竹笋放进锅里，加少许盐，翻炒一分钟\n" +
//                "\n" +
//                "3. 锅里放油，烧至4成热，把腌制好的肉片放进去炒至肉色发白，盛到碗里\n" +
//                "\n" +
//                "4. 把肥猪肉放进去炒至微微出油，放进蒜米爆香，把之前炒好的瘦肉和竹笋倒进锅里，加生抽炒匀即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("34","","西芹炒蘑菇","材料：","蘑菇250克，西芹250克，红椒1个，马蹄适量，姜适量，蒜适量，盐适量","做法：","1. 将蘑菇、马蹄切片。\n" +
//                "\n" +
//                "2. 西芹切成段，辣椒切片。\n" +
//                "\n" +
//                "3.  起油锅，爆香姜蒜，将蘑菰下锅煸炒。\n" +
//                "\n" +
//                "4. 蘑菇炒软后，将其它材料下锅一起炒至断青。\n" +
//                "\n" +
//                "5. 下盐调味就好了。","","","","","",""));
//        models.add(new RecipeDetailsModel("35","","蒜苗炒腊肉","材料：","蒜苗、腊肉、辣椒（少许）","做法：","1．\t准备材料。蒜苗切斜段,腊肉切片。\n" +
//                "\n" +
//                "2．\t将腊肉用小火慢慢煸出香气。\n" +
//                "\n" +
//                "3．\t油脂慢慢释出...\n" +
//                "\n" +
//                "4．\t煸至腊肉表面焦香状。\n" +
//                "\n" +
//                "5．\t先加入蒜白中大火拌炒。\n" +
//                "\n" +
//                "6．\t腊肉的咸香刚好融合至蒜苗里\n" +
//                "\n" +
//                "7．\t起锅前加入蒜苗(绿色叶子部份)及辣椒快速拌炒。\n" +
//                "\n" +
//                "8．\t蒜苗炒熟即可起锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("36","","姜爆鸭","材料：","鸭子半只，嫩姜一整块，盐适量，料酒很多","做法：","1. 嫩姜洗净切片备用。\n" +
//                "\n" +
//                "2. 鸭子切小块，用料酒腌15－60分钟，越久越好。\n" +
//                "\n" +
//                "3. 倒掉料酒，用厨房纸将鸭块上的水和料酒吸干，一定要比较干才行。\n" +
//                "\n" +
//                "4. 锅中多放些油，烧热后放入鸭块，开始爆吧，有点像油炸，但又没那么多油。\n" +
//                "\n" +
//                "5. 鸭肉开始变干，微微发黄的时候，放入姜片继续爆。\n" +
//                "\n" +
//                "6. 当姜片也开始变干了，倒出多余的油。\n" +
//                "\n" +
//                "7. 这个时候鸭肉虽然已经熟了，但是不够离骨。加些料酒和盐焖煮15分钟，焖煮过程中注意不要把水烧干了，可以继续添加料酒或者水。\n" +
//                "\n" +
//                "8. 水收干后即可出锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("37","","马来风光空心菜","材料：","参巴辣椒酱 (3汤勺), 虾米(1把), 空心菜 (1大把)\n","做法：","1. 把空心菜切成小段，洗好待用\n" +
//                "\n" +
//                "2. 把虾米和参巴辣椒酱准备好\n" +
//                "\n" +
//                "3. 在热锅内，加入四汤勺的菜油，大火时，加入虾米\n" +
//                "\n" +
//                "4. 把参巴辣椒酱加入，翻炒两分钟\n" +
//                "\n" +
//                "5. 把空心菜加入锅内，快速翻炒\n" +
//                "\n" +
//                "6. 翻炒直到菜根软\n" +
//                "\n" +
//                "7. 建议炒到较软，摆盘","","","","","",""));
//        models.add(new RecipeDetailsModel("38","","老黄瓜汤","材料：","老黄瓜1根，排骨2条，盐适量，鸡精适量","做法：","1. 将老黄瓜切大块。\n" +
//                "\n" +
//                "2. 与排骨一起入锅煮开，文火炖它2小时调味就好。","","","","","",""));
//        models.add(new RecipeDetailsModel("39","","酸辣啦啦","材料：","啦啦 (1kg), 蒜蓉适量， 姜茸适量，辣椒仔3 条（切粒）,  鸡蛋1 粒（打散）","调味料：","生抽 1.5 汤匙，糖1.5 汤匙， 盐：1/2 茶匙， 番茄酱3 汤匙， 辣椒酱3 汤匙， 白米醋 3 汤匙，清水250mL （搅拌均匀，待用）\n","打芡：","玉米粉+清水","做法：","1. 烧一锅水，把啦啦烫至开口 ，捞起。以流动水把每粒啦啦冲洗干净。\n" +
//                "\n" +
//                "2. 烧少许油，爆香蒜蓉，姜茸和辣椒仔。\n" +
//                "\n" +
//                "3. 倒入调味料煮滚。加入啦啦。\n" +
//                "\n" +
//                "4. 倒入蛋液拌均。打芡即可。","",""));
//        models.add(new RecipeDetailsModel("40","","口水鸡","材料：","鸡肉，盐适量，料酒1勺，葱，姜，酱油，姜蒜汁，芝麻酱，花椒油，白糖，醋，味精，红油，麻油\n","做法：","1. 将鸡肉先用少许盐腌15分钟左右，锅内上冷水，放入整个的鸡腿，鸡胸。注入冷水没过鸡肉表面，加适量的盐、一勺料酒，葱姜煮熟。\n" +
//                "\n" +
//                "2. 加盖用大火煮开后，打去上边的浮沫。\n" +
//                "\n" +
//                "3. 然后转中火煮5-7分钟，煮好后别揭开盖子 就加盖焖10分钟 利用锅里的蒸汽将鸡肉全部蒸熟 这样最大程度保证了鸡肉的鲜嫩。\n" +
//                "\n" +
//                "4. 鸡肉焖好后 捞出 放进冰水里过凉目的是让鸡肉紧缩 保持入口有弹性。\n" +
//                "\n" +
//                "5. 将酱油、姜蒜汁、芝麻酱、花椒油、白糖、醋、味精、红油、麻油于碗中对成汁淋在鸡条上，撒上芝麻、花生末、葱花即成。","","","","","",""));
//        models.add(new RecipeDetailsModel("41","","蒜苗炒豆干","材料：","蒜苗两棵， 豆干一块，烧肉300克 ，盐少许，生抽少许","做法：","1．将豆干切块。\n" +
//                "\n" +
//                "2．蒜苗切段待用。\n" +
//                "\n" +
//                "3．起油锅，爆香蒜头，下烧肉煸炒。\n" +
//                "\n" +
//                "4．烧肉炒熟煸香后，下豆干炒匀。\n" +
//                "\n" +
//                "5．下蒜苗一起炒至段青。\n" +
//                "\n" +
//                "6．下盐、生抽调味就可以出锅了。","","","","","",""));
//        models.add(new RecipeDetailsModel("42","","猪肉豆腐丸","材料：","豆腐一块，肉馅一点，淀粉，鸡蛋一个，虾仁剁碎， 胡椒粉， 盐，葱\n","做法：","1．豆腐放碗里碾碎，葱姜切末，淀粉兑水，虾仁剁碎。\n" +
//                "\n" +
//                "2．把豆腐，鸡蛋，肉馅，葱姜末，虾仁，水淀粉，盐，胡椒粉都放在一起搅拌均匀。\n" +
//                "\n" +
//                "3．锅里倒油，差不多七成热就可以下锅了，用手或者勺子做成丸子状，炸成金黄即可出锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("43","","西芹灯笼椒","材料：","西芹，灯笼椒，盐","做法：","1．食材洗净切好备用\n" +
//                "\n" +
//                "2．热锅冷油，油温后放入切好食材快速翻炒。\n" +
//                "\n" +
//                "3．炒至变色后放入盐调味即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("44","","咖哩鸡","材料：","鸡肉，熟土豆，精盐，鸡精，咖哩粉，料酒，鲜汤，水淀粉\n","做法：","1. 将鸡肉洗净，土豆切成滚刀块；\n" +
//                "\n" +
//                "2. 坐锅点火倒入油，油温四成热，放入咖哩粉炒出香味，倒入鸡肉、土豆煸炒，加入精盐、鲜汤、鸡精，用小火焖20分钟，出锅前水淀粉勾薄芡，即可出锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("45","","清炒豆苗","材料：","豆苗1斤，蒜末适量，盐适量，干贝汁适量","做法：","1. 豆苗洗净待用。\n" +
//                "\n" +
//                "2. 锅里放油，稍热后下蒜末爆香后放入豆苗，翻炒几下后后盖上锅盖焖2分钟。\n" +
//                "\n" +
//                "3. 加入适量盐及干贝汁调味即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("46","","咸鱼炒豆芽菜","材料：","豆芽菜，青葱，咸鱼，蒜头， 姜丝， 鱼露\n","做法：","1．把豆芽菜，青葱，红椒丝，清洗干净备用\n" +
//                "\n" +
//                "2．先把咸鱼煎香后，捞起…留下咸鱼油耒爆香蒜蓉，姜丝，红椒丝\n" +
//                "\n" +
//                "3．这时候开最大火，下豆芽菜翻炒到芽菜己変透明时，下青葱，煎香的咸鱼，最后淋下鱼露就可以上菜了。","","","","","",""));
//        models.add(new RecipeDetailsModel("47","","ABC 汤","材料：","胡萝卜，土豆，洋葱，番茄，榨菜，猪骨头","做法：","1. 榨菜洗净切掉皮较硬部分然后切丝，土豆、洋葱、番茄洗净切块状，胡萝卜切片，猪骨头洗净备用。\n" +
//                "\n" +
//                "2. 胡萝卜，土豆，洋葱，番茄和榨菜全部放入砂煲内。另用一个小锅加入水，水烧开后放入猪骨头穿烫大约1分钟（看到杂质和血水浮在水面后）然后捞起猪骨头放去刚刚准备好的砂煲内。\n" +
//                "\n" +
//                "3. 放入3公升的水，然后把砂煲拿去煤气炉煲到水快要烧开时盖上盖子移去电子砂煲，煲四小时即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("48","","干烧红烧肉","材料：","五花肉，花椒，大料，生姜，红辣子，葱，蒜，糖，黄酒，盐，酱油，味精，胡椒粉","做法：","1. 把切好的五花肉，放在炒锅里干煸，不放什么东西，煸出肉的油；\n" +
//                "\n" +
//                "2. 然后将糖放入油锅内，起泡时放入刚煸出的肉，进行翻炒；\n" +
//                "\n" +
//                "3. 然后放入步骤 1的料再进行翻炒，试量加入清水，慢火炖(高压锅也可)","","","","","",""));
//        models.add(new RecipeDetailsModel("49","","白萝卜排骨汤","材料：","排骨，白萝卜，红枣，干鱿鱼","做法：","1. 先用一个小锅加入水，水烧开后放入猪骨头穿烫大约1分钟（看到杂质和血水浮在水面后）然后捞起。\n" +
//                "\n" +
//                "2. 将其他材料放入，大火滚了之后，小火煮三小时。\n" +
//                "\n" +
//                "3. 最后才加胡椒粉和少许的盐。超级美味的汤就出炉了。","","","","","",""));
//        models.add(new RecipeDetailsModel("50","","猪肉韭菜饺子","材料：","半肥猪肉150克，韭菜100克，饺子皮20张，盐，胡椒粉，姜末，花生油少许，芝麻油几滴，陈醋，辣椒酱，生抽，酱油\n","做法：","1. 猪肉剁成肉末，韭菜切成细茸。\n" +
//                "\n" +
//                "2. 把剁好的猪肉和韭菜放盘子里，加盐，酱油，胡椒粉，姜末，少许花生油，（有芝麻油就滴几滴），然后拌匀备用。\n" +
//                "\n" +
//                "3. 水烧开后，把包好的饺子放下锅里，水烧开后，添点冷水，如此反复三次， 把浮起来的饺子捞起来即可。\n" +
//                "\n" +
//                "4. 另备个小碗，放点陈醋，辣椒酱，生抽调匀，就是吃饺子的酱汁了。","","","","","",""));
//        models.add(new RecipeDetailsModel("51","","角瓜炒蛋","材料：","角瓜1条，鸡蛋 2粒，蒜茸，酱油，鸡蛋\n","做法：","1. 先准备好食材，把角瓜和葱洗净。\n" +
//                "\n" +
//                "2. 把角瓜改刀切开把中间的角瓜粒用手或勺刮掉，切块\n" +
//                "\n" +
//                "3. 爆香蒜茸和虾仁\n" +
//                "\n" +
//                "4.再倒入角瓜和少许水焖煮至角瓜软\n" +
//                "\n" +
//                "\n" +
//                "5. 把鸡蛋用筷子打匀，再把炒锅烧热倒入至七分熟。最后调入少许盐，起锅前撒上葱花即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("52","","豆腐蒸肉末","材料：","豆腐、肉末、虾仁、老抽、麻油\n","做法：","1. 虾仁切成小颗粒。肉末用老抽、麻油腌20分钟。\n" +
//                "\n" +
//                "2. 豆腐切小块，排入蒸碗中。\n" +
//                "\n" +
//                "3. 把炒好的肉末和虾仁连汤一起倒在豆腐上，上锅蒸。\n" +
//                "\n" +
//                "4. 水开后10分钟取出，撒上香葱末即可。搭配香菜更好。","","","","","",""));
//        models.add(new RecipeDetailsModel("53","","风味卤肉蛋","材料：","梅花肉，鸡蛋，酱油，米酒，冰糖，油，豆干","做法：","1. 鸡蛋冷水下锅，盖好盖子煮熟\n" +
//                "\n" +
//                "2. 稍微油煎豆干\n" +
//                "\n" +
//                "3. 熟后冷水泡一下去壳，在表面划刻痕，方便入味；\n" +
//                "\n" +
//                "4. 准备好香叶，八角，姜片，葱段\n" +
//                "\n" +
//                "\n" +
//                "5. 肉洗净，切块状；\n" +
//                "\n" +
//                "6.\t锅里放油烧热，下梅花肉，小火煎至两面微焦；\n" +
//                "\n" +
//                "7.\t然后下葱段，八角，姜片，香味等，重点把葱段煎香一下；\n" +
//                "\n" +
//                "8.\t然后加入酱油；加入米酒和清水；水适量调整，差不多淹到肉表面左右；\n" +
//                "\n" +
//                "9.\t加入冰糖；加入备好的鸡蛋和豆干，大火煮开，转小火煲煮；\n" +
//                "\n" +
//                "\n" +
//                "10.\t煮约1小时左右。","","","","","",""));
//        models.add(new RecipeDetailsModel("54","","老姜酱油鸡","材料：","鸡腿，老姜，蒜茸，酱油，素食蚝油， 麻油，盐巴，胡椒粉\n","做法：","1. 将鸡腿洗净剁块，加入所有调味料，充分的搅拌均匀待用。\n" +
//                "\n" +
//                "2. 取出锅加入适量的食油，蒜蓉姜片下锅爆炒，然后加入腌制好的鸡肉块（10分钟就好）\n" +
//                "\n" +
//                "3. 大火炒翻至半鸡肉熟透，半收汁。如果想要多汁可以加少许食水焖煮。","","","","","",""));
//        models.add(new RecipeDetailsModel("55","","清炒奶白菜","材料：","奶白菜、蒜蓉、 虾仁、生抽\n","做法：","1. 菜洗淨，蒜剁成蓉。\n" +
//                "\n" +
//                "2. 锅烧热至微微出烟， 然后加入油，放一半的蒜和虾仁。\n" +
//                "\n" +
//                "3. 等蒜和虾仁出香味就可以下入奶白菜。\n" +
//                "\n" +
//                "4. 翻炒，看到菜有点透明但还是很脆时，洒盐，小许生抽还有另一半蒜，翻均。\n" +
//                "\n" +
//                "\n" +
//                "5. 出锅，装盘。","","","","","",""));
//        models.add(new RecipeDetailsModel("56","","腊肉烩豆腐","材料：","腊肉 1块、豆腐 1块、生菜 1小棵、蚝油2汤匙、白糖1茶匙、盐1/4茶匙、白胡椒粉1/2茶匙、水淀粉2汤匙、蒜茸少许\n","做法：","1. 豆腐切2cm大的小块，放入煎锅中，用中火双面煎成金黄色。青葱洗净切成段。\n" +
//                "\n" +
//                "2．煎锅中倒入少许油，大火加热至7成热时，放入蒜茸爆香，然后倒入腊肉翻炒香。\n" +
//                "\n" +
//                "3．倒入豆腐，调入蚝油，白糖，盐和胡椒粉翻炒均匀后，倒入水（没过食材一半即可）盖上锅盖，用中火炖5分钟，带开盖子，淋入水淀粉搅均即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("57","","宫保鸡丁","材料：","鸡胸肉、腰豆/花生仁、白糖、酱油、水淀粉、青椒、姜末、蒜茸、大葱、料酒、盐、干辣椒","做法：","1. 鸡胸肉洗净擦干水分，切成1.5cm见方的小丁，再调入水淀粉和酱油溷合均匀，腌制20分钟。大葱洗净，切成1cm长的小段。干辣椒剪去两头，去除辣椒籽。\n" +
//                "\n" +
//                "２. 在小碗中调入水淀粉、酱油、盐、白砂糖和料酒，溷合均匀制成调味欠汁。\n" +
//                "\n" +
//                "３. 中火烧热锅中的油，待烧至三成热时将花生仁/ 腰豆放入，转小火慢慢炸至微微上色，捞出沥干油分待用。\n" +
//                "\n" +
//                "４. 继续中火烧热锅中的油，待烧至六成热时将腌好的鸡丁放入，迅速滑炒至散，过油约半分钟，待鸡肉呈熟色，再捞出沥干油分。\n" +
//                "\n" +
//                "５. 锅中留底油，烧热后将青椒和干辣椒放入，用小火煸炸出香味，随后放入大葱段、姜末、蒜茸和鸡丁翻炒片刻，最后调入芡汁，待汤汁渐稠后放入腰豆/花生仁拌炒数下即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("58","","清炒青龙菜","材料：","青龙菜、蒜 、盐\n","做法：","1. 准备好材料\n" +
//                "\n" +
//                "2. 青龙菜洗净切段，蒜切末。\n" +
//                "\n" +
//                "3. 热锅放油，倒入蒜末，待蒜爆到金黄色时倒入青龙菜，快速翻炒约30秒，放盐调味，菜变软就可上盘了。","","","","","",""));
//        models.add(new RecipeDetailsModel("59","","甲必丹鸡","材料：","4-6 只鸡腿 （或半只鸡切块）用一点黄姜粉和盐巴腌 10分钟、2 杯浓椰酱、疯柑叶 切丝","辛香料和调味料：","以下材料搅拌成煳状（或者石捣臼捣烂）：\n" +
//                "\n" +
//                "\n" +
//                "香茅、兰姜、老姜、黄姜 或 黄姜粉代替、红葱 、中型洋葱、蒜瓣、石栗  或 5-6 只 腰果、虾酱 、辣椒干 ","做法：","1. 把材料都准备好。热好一口锅，倒入大约 1/4 杯的食油，把搅拌好的辛香料和刚刚切段拍扁的香茅一起煸炒至边上泛油。\n" +
//                "\n" +
//                "2. 把鸡肉块倒入，一起煸炒至鸡皮有点焦香的样子。加入疯柑叶丝，稍微翻炒，倒入2杯水大火煮滚转中或火焖煮大约20分钟，加入浓椰浆、盐和糖调味。继续中火焖煮至浓稠即可，大约20分钟。","","","",""));
//        models.add(new RecipeDetailsModel("60","","家常豆腐","材料：","豆腐、适量食盐、适量鸡精、适量葱、适量姜、适量蒜、适量生抽、适量豆瓣、白糖适量、水适量\n","做法：","1. 将豆腐放入蒸锅中蒸10分钟左右，取出凉一下备用\n" +
//                "\n" +
//                "2. 将豆腐切块，薄厚适中就行\n" +
//                "\n" +
//                "3. 锅内放油烧至6成热左右，放入豆腐块，煎至两面金黄出锅备用\n" +
//                "\n" +
//                "4. 锅内用炸豆腐的油烧至7成热时放入葱、姜、蒜爆香。\n" +
//                "\n" +
//                "5. 放入煎好的豆腐块，翻炒，放入一小勺糖，放入适量生抽翻炒，放入少许清水\n" +
//                "\n" +
//                "6. 翻炒汤汁快没的时候，放入少许盐和鸡精出锅即可","","","","","",""));
//        models.add(new RecipeDetailsModel("61","","椰奶黑糯米","材料：","黑糯米、水、黄冰糖/片冰糖、桂圆、香兰叶、椰糖 （选择性）","做法：","1. 黑糯米洗净泡水2个小时，泡糯米的水呈黑紫色是正常的，只要米粒不变白色，就是纯正的黑糯米。\n" +
//                "\n" +
//                "2. 泡好的黑糯米、桂圆和2-3片香兰叶加上6-7杯水煮滚，转小火熬一个小时，间中搅拌几次避免沉底。一个小时后加入冰糖和椰糖，加盖虚焖30分钟。\n" +
//                "\n" +
//                "3. 然后搅拌均匀，吃的时候加入椰奶（新鲜的最好，不然罐头椰奶也行）。","","","","","",""));
//        models.add(new RecipeDetailsModel("62","","黑糖椰浆沙谷米","材料：","黑糖 、开水 、椰浆、沙谷米\n","做法：","1. 沙谷米浸在水中，泡软下！\n" +
//                "\n" +
//                "2. 把沙谷米逐渐加入煮沸的水中。要不时的搅拌，以免沙谷米黏在一块。\n" +
//                "\n" +
//                "3. 准备一盆冰块开水。让煮到变半透明的沙谷米可以“冷”一下。\n" +
//                "\n" +
//                "4. 滤干水的沙谷米倒入可以遇热的盆子里，放入热锅里继续蒸熟。\n" +
//                "\n" +
//                "5. 等到的当儿可以把黑糖加水煮沸。让黑糖融化。但是也要不时搅拌，以免黑糖变焦糖。\n" +
//                "\n" +
//                "6. 蒸熟后了的沙谷米，黑糖和椰浆都先收入冰箱。待冷了才先享用。\n" +
//                "\n" +
//                "7. 方法就是把沙谷米，黑糖和椰浆都舀一些倒入杯子里就可以吃了。","","","","","",""));
//        models.add(new RecipeDetailsModel("63","","酸甜啦啦","材料：","番茄酱、辣椒酱、酸梅酱、糖、盐、柠檬/柠檬汁、啦啦、咕噜肉酱汁、姜丝、蒜茸 ","做法：","1. 啦啦有很多泥，买回来后，浸盐水1小时。 \n" +
//                "\n" +
//                "2. 用滚烫的热水烫过一遍就马上倒掉热水，再重覆一次。 之后逐一检查啦啦，丢弃打不开的。 啦啦此刻已经熟了。\n" +
//                "\n" +
//                "3. 用少许油爆香姜丝、蒜茸\n" +
//                "\n" +
//                "4. 倒入酱汁\n" +
//                "\n" +
//                "5. 倒入熟了的啦啦快速翻炒，让啦啦沾上酱汁即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("64","","罗汉果海底椰","材料：","罗汉果 2粒、海底椰、桂圆适量、斑兰叶6-8叶、冰糖适量、清水","做法：","1.把全部材料（除了冰糖）放入锅里，煮至沸滚。 \n" +
//                "\n" +
//                "2. 转中火焖煮约1个小时。\n" +
//                "\n" +
//                "3. 拿出斑兰叶。放入冰糖，煮滚。","","","","","",""));
//        models.add(new RecipeDetailsModel("65","","芋头扣肉","材料：","带皮五花肉、芋头、调料色拉油、绍酒、酱油、糖、水淀粉、八角、大蒜\n","做法：","1. 五花肉入油炸前用牙签在肉皮上扎洞, 然后整块放入沸水中大火煮15分钟，取出后用酱油腌渍10分钟。\n" +
//                "\n" +
//                "2. 再放入烧至五成热的色拉油中小火浸炸2分钟至五花肉表面上色，捞出后立刻放入冷水中浸泡。\n" +
//                "\n" +
//                "3. 芋头去皮，切成大片，放入烧至五成热的色拉油中小火浸炸2分钟后捞出，控油；五花肉切成同芋头一样大小的厚片，再次放入烧至五成热的色拉油中小火炸2分钟。\n" +
//                "\n" +
//                "4. 取出五花肉再以一片肉一片芋头的方式放入碗内，并淋上用绍酒、酱油、糖、些许清水、八角、大蒜调好的汁。\n" +
//                "\n" +
//                "\n" +
//                "5. 将摆有肉和芋头的碗上笼大火蒸40分钟，取出后将汤汁倒入锅内，拣出八角、大蒜，将肉和芋头扣入盘内，汤汁用水淀粉勾芡后，淋在肉和芋头上即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("66","","芙蓉蛋","材料：","鲜虾、生香菇、鸡蛋、青葱、胡椒、盐、油\n","做法：","1. 将青葱切小段，较粗的部分还可以对剖让它细一点。\n" +
//                "\n" +
//                "2. 生香菰去蒂，切成小薄片。\n" +
//                "\n" +
//                "3. 鲜虾也对剖。\n" +
//                "\n" +
//                "4. 打入3颗蛋，将蛋打散，加入盐和胡椒调味。\n" +
//                "\n" +
//                "5. 将虾、葱、姑放入拌匀。\n" +
//                "\n" +
//                "6. 小锅加入3大匙的油，中火烧热。芙蓉蛋要稍多的油，半炸半煎蛋皮才会膨松漂亮好吃。\n" +
//                "\n" +
//                "7. 将蛋液材料倒入锅中, 趁蛋液尚未凝固将材料摊平成圆形。\n" +
//                "\n" +
//                "8. 蛋液煎至半熟后，晃动一下锅子确定没有黏底可以滑动。\n" +
//                "\n" +
//                "9. 可以用锅铲直接翻面。将另一面煎约1-2分钟。\n" +
//                "\n" +
//                "10.  煎好后再翻一次面，稍微煎一下就可起锅。","","","","","",""));
//        models.add(new RecipeDetailsModel("67","","鸡精鸡","材料：","鸡腿、鸡精 、姜片 、枸杞","做法：","1. 鸡腿去皮，切块，放入全部调味料腌30分钟。\n" +
//                "\n" +
//                "2. 加入姜片和鸡精，拌均匀，放入滚水的蒸笼里，蒸约25分钟至熟，即可。\n" +
//                "\n" +
//                "3. 也可加入几片当归和枸杞，就成了当归鸡精蒸鸡了。","","","","","",""));
//        models.add(new RecipeDetailsModel("68","","花生煳","材料：","即食去衣花生、白米  、水  、幼滑花生酱、冰糖\n","做法：","1. 白米洗净，清水浸1小时以上。\n" +
//                "\n" +
//                "2. 即食花生与沥干水的白米一同放进搅拌机，再加入1L水一同以快速搅拌3分钟，停机休息1分钟再快速搅拌，此步骤重复两次，共搅拌约11-12分钟。\n" +
//                "\n" +
//                "3. 搅拌完成后直接倒进煲内，先取其中约3汤匙与幼滑花生酱开稀，再倒回煲中，加入冰糖以中小火煮至糖溶（期间不加盖及间中用汤勺搅拌以防黏底。\n" +
//                "\n" +
//                "4. 糖完全溶化后，花生煳会越煮越浓稠然后即可享用。","","","","","",""));
//        models.add(new RecipeDetailsModel("69","","桃胶红枣银耳羹","材料：","桃胶、银耳、红枣、白果、冰糖、龙眼干\n","做法：","1．\t桃胶用清水浸泡24个小时，期间换两次水，泡发好的桃胶去除杂质。银耳温水泡发一个小时，洗净去蒂，撕成小朵。红枣洗净浸泡半个小时，冰糖备用。\n" +
//                "\n" +
//                "2．\t桃胶里的杂质一定细细去处，直接影响羹品的口感\n" +
//                "\n" +
//                "3．\t银耳撕成小朵\n" +
//                "\n" +
//                "4．\t锅子里加水，放入银耳、冰糖、白果、龙眼干、红枣\n" +
//                "\n" +
//                "5．\t小火炖煮半个小时，加入洗净的桃胶，再小火炖半个小时即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("70","","麦片虾","材料：","虾(去虾壳)、酱青少许、玉米粉少许、NESTUM麦片半杯、咖哩叶4-5片、小辣椒两条、糖2-3汤匙、少许蒜茸\n","做法：","1. 虾加入酱青以及玉米粉腌半小时。\n" +
//                "\n" +
//                "2. 热油，将腌好的虾炸至金黄，拿起待用。\n" +
//                "\n" +
//                "3. 用少许油爆香蒜茸，小辣椒及咖哩叶。\n" +
//                "\n" +
//                "4. 加入糖翻炒直糖溶化。\n" +
//                "\n" +
//                "5. 加入麦片翻炒直出香味。\n" +
//                "\n" +
//                "6. 最后加入虾翻炒几下，即可上桌。","","","","","",""));
//        models.add(new RecipeDetailsModel("71","","咖哩虾","材料：","鲜虾、洋葱1、咖喱粉、椰浆、盐、糖、柠檬汁、食用油均适量","做法：","1. 先去除虾线，洗净备用；洋葱切小块，取其中一部分切末。\n" +
//                "\n" +
//                "2. 锅热后，倒入适量食用油，把洋葱末放入锅中翻炒出香。\n" +
//                "\n" +
//                "3. 把淋干水分的虾一次性倒入锅中，大火翻炒。\n" +
//                "\n" +
//                "4. 待虾的表层完全变色后，加入两大勺咖喱粉。\n" +
//                "\n" +
//                "\n" +
//                "5. 倒入准备好的椰浆，大火翻炒均匀，让咖喱和椰浆完全融合。\n" +
//                "\n" +
//                "6. 添加适量咖喱粉、加少许盐和糖翻炒，待锅开后，转小火烧制3—5分钟，让虾入味。\n" +
//                "\n" +
//                "\n" +
//                "7. 加入洋葱块，翻炒均匀；待洋葱稍变软后，淋少许柠檬汁提味，关火出锅即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("72","","南瓜西密露","材料：","沙谷米，南瓜（小）1/6个，细砂糖，水2碗\n","做法：","1. 南瓜去皮去籽，切小丁，放入蒸锅以中火蒸熟。\n" +
//                "\n" +
//                "2. 水煮滚，放入沙谷米，以中小火煮6分钟，加入细砂糖煮溶，熄火。\n" +
//                "\n" +
//                "3. 放入蒸熟的南瓜丁拌匀即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("73","","咸蛋虾姑肉","材料：","去壳的虾姑肉、1粒煮熟的咸蛋黄、煎炸粉、蛋白\n","腌料：","粟粉、胡椒粉、盐","配料：","蒜头、辣椒丝、咖哩叶\n","调味料：","牛油、盐、咖哩粉、蚝油、酱青、淡奶","做法：","1．将虾姑肉洗净，加入腌料腌制1小时。\n" +
//                "\n" +
//                "2．热油， 将虾姑肉沾上蛋白和煎炸粉，然后炸至金黄色，捞起沥干备用。\n" +
//                "\n" +
//                "3．将锅力里多余的油倒掉。\n" +
//                "\n" +
//                "4．把牛油煮溶再爆香蒜头、咖哩叶和咸蛋慢火翻炒片刻后加入辣椒丝炒至香。\n" +
//                "\n" +
//                "5．倒入淡奶和调味料煮至浓稠，加入炸好的虾姑肉翻炒均匀即可上桌。"));
//        models.add(new RecipeDetailsModel("74","","娘惹酸甜荷包蛋","材料：","鸡蛋、盐、 酱油、蚝油、 红糖、辣椒酱 、辣椒、酸梅酱、淀粉、洋葱\n","做法：","1. 将所有调味料倒在一个碗内，按照自己的口味调和，可以简单的用盐、糖、水、淀粉。\n" +
//                "\n" +
//                "2. 平底锅倒油，油冒烟后转中火，打入鸡蛋成荷包蛋。火候保持中火，可以吃到外焦内软的溏心蛋，不喜欢的可以转小火。\n" +
//                "\n" +
//                "3. 等到底部完全凝住，并微微焦煳后，翻面。\n" +
//                "\n" +
//                "4. 将调好的调味料、辣椒和洋葱倒入，转大火收汁，朝下的一面凝住即可出锅。\n" +
//                "\n" +
//                "5. 不要煎太久，鸡蛋会变老，如果汁多了，可以先将鸡蛋盛出，汁收得差不多了再浇在荷包蛋上。","","","","","",""));
//        models.add(new RecipeDetailsModel("75","","花生仁汤","材料：","花生仁、冰糖、水\n","做法：","1. 检查花生仁状况，把破裂或有味道的挑出来。\n" +
//                "\n" +
//                "2. 将花生仁用清水洗净。\n" +
//                "\n" +
//                "3. 花生仁先用冷水泡约1小时，然后剥好外皮。\n" +
//                "\n" +
//                "4. 让花生仁还带一点点水，放到冰箱冷冻，比较容易煮烂。\n" +
//                "\n" +
//                "\n" +
//                "5. 把1.5倍水加入冻好的花生仁，用快锅煮30分钟， 试试看花生是否松软了, 如果是就进行下一个步骤, 如果不是就继续煮, 煮到花生松软。\n" +
//                "\n" +
//                "6. 作法5中加入冰糖，轻轻搅拌一下。","","","","","",""));
//        models.add(new RecipeDetailsModel("76","","紫菜豆腐汤","材料：","豆腐、紫菜、姜片、盐、胡椒粉、蘑菇、西芹少许","做法：","1. 豆腐用清水浸半小时后切成小粒。\n" +
//                "\n" +
//                "2. 紫菜用清水浸软洗净。\n" +
//                "\n" +
//                "3. 水烧开后，加入姜片、蘑菇、西芹和豆腐块煮10分钟，然后加入紫菜煮10分钟。\n" +
//                "\n" +
//                "4. 加入适量盐和胡椒粉调味即可。","","","","","",""));
//        models.add(new RecipeDetailsModel("77","","辣炒竹笋","材料：","竹笋、糟辣椒、蒜瓣\n","做法：","1. 把笋洗净，切片。\n" +
//                "\n" +
//                "2. 热锅冷油，下蒜片炒香。\n" +
//                "\n" +
//                "3. 倒入竹笋翻炒。\n" +
//                "\n" +
//                "4. 稍炒一下，放少量的盐，炒匀。\n" +
//                "\n" +
//                "\n" +
//                "5. 炒到笋差不多熟了的时候再放糟辣椒,炒匀后即可上菜。","","","","","",""));
//        models.add(new RecipeDetailsModel("78","","海带味增汤","材料：","海带、豆腐、味增、萝卜\n","做法：","1. 海带用水泡开，煮到软化；豆腐切小块。\n" +
//                "\n" +
//                "2. 在锅中加入水、煮开。\n" +
//                "\n" +
//                "3. 煮滚了以后，加入味增使之融化，加入盐、胡椒调味，淋上香油，加入海带，豆腐、萝卜。","","","","","",""));
//        models.add(new RecipeDetailsModel("79","","青椒虾仁","材料：","虾仁，青椒，盐 ，蒜茸","做法：","1. 虾仁去壳\n" +
//                "\n" +
//                "2. 食材洗净切好备用\n" +
//                "\n" +
//                "3. 热锅后，爆香蒜茸和虾仁\n" +
//                "\n" +
//                "4. 再放入切好食材快速翻炒\n" +
//                "\n" +
//                "5. 炒至变色后放入盐调味即可","","","","","",""));
//        models.add(new RecipeDetailsModel("80","","日本豆腐蒸蛋","材料：","虾仁，日本豆腐，鸡蛋，青葱\n","材料：","麻油，酱油","做法：","1. 虾仁去壳\n" +
//                "\n" +
//                "2. 日本豆腐切片摆盘\n" +
//                "\n" +
//                "3. 鸡蛋打散加入些许清水倒入盘中\n" +
//                "\n" +
//                "4. 把虾仁放在豆腐上面\n" +
//                "\n" +
//                "5. 蒸25分钟。准备麻油和酱油\n" +
//                "\n" +
//                "5. 蒸好后撒上调味料和葱花","","","",""));
//
//
//        DatabaseReference reference = FirebaseDatabase.getInstance().getReference().child("Recipes");
//
//        for (int i=0;i<models.size();i++) {
//            String id = UUID.randomUUID().toString();
//
//            HashMap<String, Object> map = new HashMap<>();
//            map.put("id", models.get(i).getId());
//            map.put("imageURl",models.get(i).getImageURl());
//            map.put("mainTitle",models.get(i).getMainTitle());
//            map.put("title1",models.get(i).getTitle1());
//            map.put("desc1",models.get(i).getDesc1());
//            map.put("title2",models.get(i).getTitle2());
//            map.put("desc2",models.get(i).getDesc2());
//            map.put("title3",models.get(i).getTitle3());
//            map.put("desc3",models.get(i).getDesc3());
//            map.put("title4",models.get(i).getTitle4());
//            map.put("desc4",models.get(i).getDesc4());
//            map.put("title5",models.get(i).getTitle5());
//            map.put("desc5",models.get(i).getDesc5());
//
//            reference.child(id).setValue(map);
//        }
//    }

}